# Northwind Traders Database - SQL Window Functions Practice

## Set Up Notebook

In [1]:
from dotenv import load_dotenv
import os

load_dotenv()

database_url = os.getenv('DB_PASSWORD')

In [2]:
%load_ext sql

In [3]:
%sql postgresql://postgres:$DB_PASSWORD@localhost:5432/northwind

In [4]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Drop `photo` (un-viewable within output)

In [ ]:
%sql ALTER TABLE employees DROP COLUMN photo

## Table List

In [6]:
%%sql
SELECT
    table_name AS name,
    table_type AS type
FROM information_schema.tables
WHERE
    table_schema = 'public'
    AND table_type IN ('BASE TABLE', 'VIEW');

 * postgresql://postgres:***@localhost:5432/northwind
17 rows affected.

[('territories', 'BASE TABLE'),
 ('orders_employees', 'VIEW'),
 ('order_details', 'BASE TABLE'),
 ('employee_territories', 'BASE TABLE'),
 ('us_states', 'BASE TABLE'),
 ('customers', 'BASE TABLE'),
 ('orders', 'BASE TABLE'),
 ('employees', 'BASE TABLE'),
 ('shippers', 'BASE TABLE'),
 ('products', 'BASE TABLE'),
 ('categories', 'BASE TABLE'),
 ('suppliers', 'BASE TABLE'),
 ('region', 'BASE TABLE'),
 ('customer_demographics', 'BASE TABLE'),
 ('customer_customer_demo', 'BASE TABLE'),
 ('orders_customers', 'VIEW'),
 ('orders_products', 'VIEW')]

## Column List

In [ ]:
%%sql
SELECT
    table_name AS TABLE,
    column_name AS COLUMN,
    ordinal_position AS pos
FROM information_schema.columns
WHERE
    table_schema = 'public'
    AND table_name = 'territories';
-- Change table name here

## Create Views

### orders_customers

In [ ]:
%%sql
CREATE VIEW orders_customers AS
SELECT c.company_name, c.contact_name, c.contact_title, c.address, c.city, c.region, c.postal_code, c.country, c.phone, c.fax, o.*
FROM orders o
    JOIN customers c ON o.customer_id = c.customer_id;

### orders_products

In [ ]:
%%sql
CREATE VIEW orders_products AS
SELECT
    p.product_id,
    p.product_name,
    p.supplier_id,
    p.category_id,
    p.quantity_per_unit,
    p.units_in_stock,
    p.units_on_order,
    p.reorder_level,
    p.discontinued,
    od.order_id,
    od.unit_price,
    od.quantity,
    od.discount,
    o.customer_id,
    o.employee_id,
    o.order_date,
    o.required_date,
    o.shipped_date,
    o.ship_via,
    o.freight,
    o.ship_name,
    o.ship_address,
    o.ship_city,
    o.ship_region,
    o.ship_postal_code,
    o.ship_country
FROM
    products p
    JOIN order_details od ON p.product_id = od.product_id
    JOIN orders o ON od.order_id = o.order_id;

### orders_employees

In [ ]:
%%sql
CREATE VIEW orders_employees AS
SELECT
    e.employee_id,
    e.last_name,
    e.first_name,
    e.title,
    e.title_of_courtesy,
    e.birth_date,
    e.hire_date,
    e.address,
    e.city,
    e.region,
    e.postal_code,
    e.country,
    e.home_phone,
    e.extension,
    -- e.notes,
    e.reports_to,
    o.order_id,
    o.customer_id,
    o.order_date,
    o.required_date,
    o.shipped_date,
    o.ship_via,
    o.freight,
    o.ship_name,
    o.ship_address,
    o.ship_city,
    o.ship_region,
    o.ship_postal_code,
    o.ship_country
FROM employees e
    JOIN orders o ON e.employee_id = o.employee_id;

## Rank Employee Performance

In [19]:
%%sql
WITH
    employee_sales AS (
        SELECT
            e.employee_id,
            e.first_name,
            e.last_name,
            ROUND(
                SUM(
                    quantity * unit_price * (1 - discount)
                )::numeric,
                2
            ) AS total_sales
        FROM
            orders_employees e
            JOIN order_details d ON e.order_id = d.order_id
        GROUP BY
            e.employee_id,
            e.first_name,
            e.last_name
    )
SELECT *, RANK() OVER (
        ORDER BY total_sales DESC
    ) AS sales_rank
FROM employee_sales;

 * postgresql://postgres:***@localhost:5432/northwind
9 rows affected.

[(4, 'Margaret', 'Peacock', Decimal('232890.85'), 1),
 (3, 'Janet', 'Leverling', Decimal('202812.84'), 2),
 (1, 'Nancy', 'Davolio', Decimal('192107.60'), 3),
 (2, 'Andrew', 'Fuller', Decimal('166537.76'), 4),
 (8, 'Laura', 'Callahan', Decimal('126862.28'), 5),
 (7, 'Robert', 'King', Decimal('124568.23'), 6),
 (9, 'Anne', 'Dodsworth', Decimal('77308.07'), 7),
 (6, 'Michael', 'Suyama', Decimal('73913.13'), 8),
 (5, 'Steven', 'Buchanan', Decimal('68792.28'), 9)]

### Findings:
- Margaret Peacock is the highest-ranking in total sales
- Steven Buchanan is the lowest-ranking in total sales

## Running Total Monthly Sales

In [53]:
%%sql
WITH
    total_sales_month AS (
        SELECT DATE_TRUNC('month', order_date)::DATE AS month, SUM(
                unit_price * quantity * (1 - discount)
            ) AS total_sales
        FROM orders o
            LEFT JOIN order_details od ON o.order_id = od.order_id
        GROUP BY
            DATE_TRUNC('month', order_date)
    )
SELECT MONTH, ROUND(
        SUM(total_sales) OVER (
            ORDER BY MONTH
        )::NUMERIC, 2
    ) AS running_total
FROM total_sales_month;

 * postgresql://postgres:***@localhost:5432/northwind
23 rows affected.

[(datetime.date(1996, 7, 1), Decimal('27861.90')),
 (datetime.date(1996, 8, 1), Decimal('53347.17')),
 (datetime.date(1996, 9, 1), Decimal('79728.57')),
 (datetime.date(1996, 10, 1), Decimal('117244.30')),
 (datetime.date(1996, 11, 1), Decimal('162844.34')),
 (datetime.date(1996, 12, 1), Decimal('208083.97')),
 (datetime.date(1997, 1, 1), Decimal('269342.04')),
 (datetime.date(1997, 2, 1), Decimal('307825.68')),
 (datetime.date(1997, 3, 1), Decimal('346372.90')),
 (datetime.date(1997, 4, 1), Decimal('399405.85')),
 (datetime.date(1997, 5, 1), Decimal('453187.14')),
 (datetime.date(1997, 6, 1), Decimal('489549.94')),
 (datetime.date(1997, 7, 1), Decimal('540570.80')),
 (datetime.date(1997, 8, 1), Decimal('587858.47')),
 (datetime.date(1997, 9, 1), Decimal('643487.71')),
 (datetime.date(1997, 10, 1), Decimal('710236.94')),
 (datetime.date(1997, 11, 1), Decimal('753770.74')),
 (datetime.date(1997, 12, 1), Decimal('825169.17')),
 (datetime.date(1998, 1, 1), Decimal('919391.28')),
 (datetime.date(1998, 2, 1), Decimal('1018806.57')),
 (datetime.date(1998, 3, 1), Decimal('1123660.73')),
 (datetime.date(1998, 4, 1), Decimal('1247459.41')),
 (datetime.date(1998, 5, 1), Decimal('1265793.04'))]

## Month-Over-Month Sales Growth

In [81]:
%%sql
WITH
    total_sales_month AS (
        SELECT DATE_TRUNC('month', order_date)::DATE AS month, SUM(
                unit_price * quantity * (1 - discount)
            ) AS total_sales
        FROM orders o
            LEFT JOIN order_details od ON o.order_id = od.order_id
        GROUP BY
            DATE_TRUNC('month', order_date)
    ),
    total_sales_prev_month AS (
        SELECT month, LAG(total_sales) OVER (
                ORDER BY month
            ) AS total_sales_prev
        FROM total_sales_month
    )
SELECT
    t.month,
    ROUND(t.total_sales::NUMERIC, 2) AS total_sales,
    ROUND(((t.total_sales - total_sales_prev)/total_sales_prev)::NUMERIC, 2) AS growth
FROM
    total_sales_month t
    JOIN total_sales_prev_month tp ON t.month = tp.month;

 * postgresql://postgres:***@localhost:5432/northwind
23 rows affected.

[(datetime.date(1996, 7, 1), Decimal('27861.90'), None),
 (datetime.date(1996, 8, 1), Decimal('25485.28'), Decimal('-0.09')),
 (datetime.date(1996, 9, 1), Decimal('26381.40'), Decimal('0.04')),
 (datetime.date(1996, 10, 1), Decimal('37515.72'), Decimal('0.42')),
 (datetime.date(1996, 11, 1), Decimal('45600.05'), Decimal('0.22')),
 (datetime.date(1996, 12, 1), Decimal('45239.63'), Decimal('-0.01')),
 (datetime.date(1997, 1, 1), Decimal('61258.07'), Decimal('0.35')),
 (datetime.date(1997, 2, 1), Decimal('38483.63'), Decimal('-0.37')),
 (datetime.date(1997, 3, 1), Decimal('38547.22'), Decimal('0.00')),
 (datetime.date(1997, 4, 1), Decimal('53032.95'), Decimal('0.38')),
 (datetime.date(1997, 5, 1), Decimal('53781.29'), Decimal('0.01')),
 (datetime.date(1997, 6, 1), Decimal('36362.80'), Decimal('-0.32')),
 (datetime.date(1997, 7, 1), Decimal('51020.86'), Decimal('0.40')),
 (datetime.date(1997, 8, 1), Decimal('47287.67'), Decimal('-0.07')),
 (datetime.date(1997, 9, 1), Decimal('55629.24'), Decimal('0.18')),
 (datetime.date(1997, 10, 1), Decimal('66749.23'), Decimal('0.20')),
 (datetime.date(1997, 11, 1), Decimal('43533.81'), Decimal('-0.35')),
 (datetime.date(1997, 12, 1), Decimal('71398.43'), Decimal('0.64')),
 (datetime.date(1998, 1, 1), Decimal('94222.11'), Decimal('0.32')),
 (datetime.date(1998, 2, 1), Decimal('99415.29'), Decimal('0.06')),
 (datetime.date(1998, 3, 1), Decimal('104854.16'), Decimal('0.05')),
 (datetime.date(1998, 4, 1), Decimal('123798.68'), Decimal('0.18')),
 (datetime.date(1998, 5, 1), Decimal('18333.63'), Decimal('-0.85'))]

## High-Value Customers

In [126]:
%%sql
WITH
    order_totals AS (
        SELECT o.customer_id, o.order_id, o.contact_name, SUM(
                unit_price * quantity * (1 - discount)
            ) AS total
        FROM
            orders_customers o
            JOIN order_details od on o.order_id = od.order_id
        GROUP BY
            o.customer_id, o.order_id, o.contact_name
    )
SELECT customer_id, contact_name, ROUND(total::NUMERIC, 2) AS total,
    CASE 
        WHEN total > AVG(total) OVER() THEN 'Above Average' 
        ELSE 'Below Average'
    END AS order_totals_category
FROM order_totals
ORDER BY total DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/northwind
10 rows affected.

[('QUICK', 'Horst Kloss', Decimal('16387.50'), 'Above Average'),
 ('HANAR', 'Mario Pontes', Decimal('15810.00'), 'Above Average'),
 ('SAVEA', 'Jose Pavarotti', Decimal('12615.05'), 'Above Average'),
 ('RATTC', 'Paula Wilson', Decimal('11380.00'), 'Above Average'),
 ('SIMOB', 'Jytte Petersen', Decimal('11188.40'), 'Above Average'),
 ('KOENE', 'Philip Cramer', Decimal('10952.84'), 'Above Average'),
 ('HUNGO', 'Patricia McKenna', Decimal('10835.24'), 'Above Average'),
 ('RATTC', 'Paula Wilson', Decimal('10495.60'), 'Above Average'),
 ('QUICK', 'Horst Kloss', Decimal('10191.70'), 'Above Average'),
 ('QUICK', 'Horst Kloss', Decimal('10164.80'), 'Above Average')]